src/DataProcessors/РаботаСЗадачами/РаботаСЗадачами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РаботаСЗадачами</name>
</mdclass:DataProcessor>

src/InformationRegisters/ЗадачиМетеорВерсийХранилища/ЗадачиМетеорВерсийХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗадачиМетеорВерсийХранилища</name>
  <resources>
    <name>ЗадачаМетеор</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </resources>
  <dimensions>
    <name>ВерсияХранилища</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОценкиКачестваКода/ОценкиКачестваКода.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОценкиКачестваКода</name>
  <resources>
    <name>Оценка</name>
    <type>
      <types>EnumRef.ЗначенияОценкиКачестваКода</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>БизнесПроцесс</name>
    <type>
      <types>BusinessProcessRef.ПредварительнаяПроверка</types>
      <types>BusinessProcessRef.СогласованиеПереноса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОценки</name>
    <type>
      <types>CatalogRef.ВидыОценокКачестваКода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оцениваемый</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ЗначенияОценкиКачестваКода/ЗначенияОценкиКачестваКода.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЗначенияОценкиКачестваКода</name>
  <enumValues>
    <name>НечегоОценивать</name>
  </enumValues>
  <enumValues>
    <name>ЗамечанийНет</name>
  </enumValues>
  <enumValues>
    <name>ЕстьНезначительныеЗамечания</name>
  </enumValues>
  <enumValues>
    <name>ЕстьКритичныеЗамечания</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>ПользовательОС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Команда</name>
    <type>
      <types>CatalogRef.Команды</types>
    </type>
  </attributes>
  <attributes>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелеграмID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетеорИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_УИ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ИсторияХранилища/ИсторияХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИсторияХранилища</name>
  <owners>Catalog.Хранилища</owners>
  <attributes>
    <name>Автор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Метка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Изменены</name>
    <attributes>
      <name>ИмяОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Добавлены</name>
    <attributes>
      <name>ИмяОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Удалены</name>
    <attributes>
      <name>ИмяОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФайлыGit</name>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтарыйФайл</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтрокДобавлено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтрокУдалено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/РаботаСЗадачами/Forms/ФормаОценкиКачестваКода/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Параметры.ЗадачаИсполнителя) Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Не удалось определить бизнес процесс для оценки");
	КонецЕсли;
	БизнесПроцесс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ЗадачаИсполнителя, "БизнесПроцесс");
	
	ОценкаПоУмолчанию = Перечисления.ЗначенияОценкиКачестваКода.ЗамечанийНет;
	ИнициализироватьТаблицуОценки();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ОценкиКачестваКода

&НаКлиенте
Процедура ОценкиКачестваЗначениеОценкиПриИзменении(Элемент)
	
	ИмяТекущейКолонки = Элементы[ИмяТаблицыОценка].ТекущийЭлемент.Имя;
	ИдентификаторСтроки = Элементы[ИмяТаблицыОценка].ТекущиеДанные.ПолучитьИдентификатор();
	ИзменяемаяСтрокаРеквизита = ЭтаФорма[ИмяТаблицыОценка].НайтиПоИдентификатору(ИдентификаторСтроки);
	Если Не Элементы[ИмяТаблицыОценка].ТекущиеДанные[ИмяТекущейКолонки] Тогда
		ИзменяемаяСтрокаРеквизита[ИмяТекущейКолонки] = Истина;
		Возврат;
	КонецЕсли;
	УстановленноеЗначение = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЗначениеОценкиПоИмениПоля, ИмяТекущейКолонки);
	Если УстановленноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ИзменяемаяСтрокаРеквизита = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Для Каждого ИмяКолонки Из ЗначениеОценкиПоИмениПоля Цикл
		ИзменяемаяСтрокаРеквизита[ИмяКолонки.Ключ] = ИмяКолонки.Ключ = ИмяТекущейКолонки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьИЗакрытьНаСервере();
	Закрыть(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПропуститьОценку(Команда)
	Закрыть(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОценкуНечегоОценивать(Команда)
	УстановитьОценкуДляВсех(ПредопределенноеЗначение("Перечисление.ЗначенияОценкиКачестваКода.НечегоОценивать"));
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОценкуЗамечанийНет(Команда)
	УстановитьОценкуДляВсех(ПредопределенноеЗначение("Перечисление.ЗначенияОценкиКачестваКода.ЗамечанийНет"));
КонецПроцедуры

&НаКлиенте
Асинх Процедура ДобавитьОцениваемого(Команда)
	Оцениваемый = Ждать ВвестиЗначениеАсинх(ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"), "Введите пользователя для оценки.");
	ДобавитьОцениваемогоНаСервере(Оцениваемый);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьТаблицуОценки()
	
	// Имена колонок таблицы формы совпадают с именами колонок реквизита.
	ИмяТаблицыОценка = "ОценкаКачества";
	ИменаКолонок_ЗначенияОценки = Новый Соответствие;
	ЗначениеОценкиПоИмениКолонки = Новый Структура;
	ОписанияКолонокТаблицы = Новый Массив;
	РаботаСФормами.ДобавитьОписаниеКолонкиТаблицы(ОписанияКолонокТаблицы, "КритерийОценки", РаботаСФормами.ОписаниеТипаСправочник("ВидыОценокКачестваКода"));
	РаботаСФормами.ДобавитьОписаниеКолонкиТаблицы(ОписанияКолонокТаблицы, "Оцениваемый", РаботаСФормами.ОписаниеТипаСправочник("Пользователи"));
	Для Каждого ЗначениеПеречисления Из Метаданные.Перечисления.ЗначенияОценкиКачестваКода.ЗначенияПеречисления Цикл
		РаботаСФормами.ДобавитьОписаниеКолонкиТаблицы(ОписанияКолонокТаблицы, ЗначениеПеречисления.Имя, РаботаСФормами.ОписаниеТипаБулево(), ЗначениеПеречисления.Синоним);
		ИменаКолонок_ЗначенияОценки.Вставить(Перечисления.ЗначенияОценкиКачестваКода[ЗначениеПеречисления.Имя], ЗначениеПеречисления.Имя);
		ЗначениеОценкиПоИмениКолонки.Вставить(ЗначениеПеречисления.Имя, Перечисления.ЗначенияОценкиКачестваКода[ЗначениеПеречисления.Имя]);
	КонецЦикла;
	// Имена колонок в реквизите совпадают с именами полей в создаваемой таблице.
	ЗначениеОценкиПоИмениПоля = Новый ФиксированнаяСтруктура(ЗначениеОценкиПоИмениКолонки);
	ИменаКолонокЗначенияОценки = Новый ФиксированноеСоответствие(ИменаКолонок_ЗначенияОценки);
	РаботаСФормами.ДобавитьОписаниеКолонкиТаблицы(ОписанияКолонокТаблицы, "Комментарий", РаботаСФормами.ОписаниеТипаСтрока(0));
	РеквизитОценкаКачества = РаботаСФормами.ДобавитьРеквизитТаблицаЗначений(ЭтаФорма, ИмяТаблицыОценка, ОписанияКолонокТаблицы);
	ТаблицаФормы = РаботаСФормами.ДобавитьТаблицуФормы(ЭтаФорма, РеквизитОценкаКачества.Имя, Элементы.ГруппаОценкаКачества, РеквизитОценкаКачества.Имя);
	ТаблицаФормы.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	//#Если Сервер И Не Сервер Тогда
	//	ТаблицаФормы = Элементы.Добавить("выа", Тип("ТаблицаФормы"), ЭтаФорма);
	//#КонецЕсли
	ТаблицаФормы.КонтекстноеМеню.Доступность = Ложь;
	ТаблицаФормы.ИзменятьСоставСтрок = Ложь;

	ПутьКДаннымТаблицы = ТаблицаФормы.ПутьКДанным;
	Для Каждого Колонка Из ОписанияКолонокТаблицы Цикл
		ЭтоКолонкаЗначенияОценки = ЗначениеОценкиПоИмениКолонки.Свойство(Колонка.Имя);
		ВидПоляКолонки = ?(ЭтоКолонкаЗначенияОценки, ВидПоляФормы.ПолеФлажка, ВидПоляФормы.ПолеВвода);
		КолонкаТаблицыОценки = РаботаСФормами.ДобавитьКолонкуЭлемента(
			ЭтаФорма,
			Колонка.Имя,
			ТаблицаФормы,
			ПутьКДаннымТаблицы + "." + Колонка.Имя,
			ВидПоляКолонки,
			Колонка.Заголовок);
		Если ЭтоКолонкаЗначенияОценки Тогда
			КолонкаТаблицыОценки.УстановитьДействие("ПриИзменении", "ОценкиКачестваЗначениеОценкиПриИзменении");	
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Пользователи.Ссылка КАК Разработчик
		|ПОМЕСТИТЬ Оцениваемые
		|ИЗ
		|	БизнесПроцесс.СогласованиеПереноса КАК СогласованиеПереноса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗадачиМетеорВерсийХранилища КАК ЗадачиМетеорВерсийХранилища
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсторияХранилища КАК ИсторияХранилища
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|				ПО ИсторияХранилища.Автор = Пользователи.Код
		|			ПО ЗадачиМетеорВерсийХранилища.ВерсияХранилища = ИсторияХранилища.Ссылка
		|		ПО СогласованиеПереноса.ЗадачаМетеор = ЗадачиМетеорВерсийХранилища.ЗадачаМетеор
		|ГДЕ
		|	СогласованиеПереноса.Ссылка = &БизнесПроцесс
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Пользователи.Ссылка
		|ИЗ
		|	БизнесПроцесс.ПредварительнаяПроверка КАК ПредварительнаяПроверка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗадачиМетеорВерсийХранилища КАК ЗадачиМетеорВерсийХранилища
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсторияХранилища КАК ИсторияХранилища
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|				ПО ИсторияХранилища.Автор = Пользователи.Код
		|			ПО ЗадачиМетеорВерсийХранилища.ВерсияХранилища = ИсторияХранилища.Ссылка
		|		ПО ПредварительнаяПроверка.ЗадачаМетеор = ЗадачиМетеорВерсийХранилища.ЗадачаМетеор
		|ГДЕ
		|	ПредварительнаяПроверка.Ссылка = &БизнесПроцесс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыОценокКачестваКода.Ссылка КАК КритерийОценки,
		|	Оцениваемые.Разработчик КАК Исполнитель
		|ПОМЕСТИТЬ КритерииСИсполнителями
		|ИЗ
		|	Справочник.ВидыОценокКачестваКода КАК ВидыОценокКачестваКода
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Оцениваемые КАК Оцениваемые
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КритерииСИсполнителями.КритерийОценки КАК КритерийОценки,
		|	КритерииСИсполнителями.Исполнитель КАК Оцениваемый,
		|	ЕСТЬNULL(ОценкиКачестваКода.Оценка, &ОценкаПоУмолчанию) КАК Оценка,
		|	ЕСТЬNULL(ОценкиКачестваКода.Комментарий, """") КАК Комментарий
		|ИЗ
		|	КритерииСИсполнителями КАК КритерииСИсполнителями
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиКачестваКода КАК ОценкиКачестваКода
		|		ПО КритерииСИсполнителями.КритерийОценки = ОценкиКачестваКода.ВидОценки
		|			И КритерииСИсполнителями.Исполнитель = ОценкиКачестваКода.Оцениваемый
		|			И (ОценкиКачестваКода.БизнесПроцесс = &БизнесПроцесс)";
	Запрос.УстановитьПараметр("ОценкаПоУмолчанию", ОценкаПоУмолчанию);
	Запрос.УстановитьПараметр("БизнесПроцесс", БизнесПроцесс);
	Выборка = Запрос.Выполнить().Выбрать();
	ТаблицаОценка = ЭтаФорма[РеквизитОценкаКачества.Имя];
	Пока Выборка.Следующий() Цикл
		ИмяКолонкиЗначенияОценки = ИменаКолонокЗначенияОценки.Получить(Выборка.Оценка);
		СтрокаОценки = ТаблицаОценка.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОценки, Выборка);
		СтрокаОценки[ИмяКолонкиЗначенияОценки] = Истина;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИЗакрытьНаСервере()
	ОтветственныйОценки = Пользователи.ТекущийПользователь();
	НаборЗаписей = РегистрыСведений.ОценкиКачестваКода.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.БизнесПроцесс.Установить(БизнесПроцесс);
	Для Каждого ОценкаКачества Из ЭтаФорма[ИмяТаблицыОценка] Цикл
		Оценка = Неопределено;
		Для Каждого КлючИЗначение Из ЗначениеОценкиПоИмениПоля Цикл
			КолонкаОценки = КлючИЗначение.Ключ;
			Если ОценкаКачества[КолонкаОценки] Тогда
				Оценка = КлючИЗначение.Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Запись = НаборЗаписей.Добавить();
		Запись.БизнесПроцесс = БизнесПроцесс;
		Запись.ВидОценки = ОценкаКачества.КритерийОценки;
		Запись.Оцениваемый = ОценкаКачества.Оцениваемый;
		Запись.Оценка = Оценка;
		Запись.Ответственный = ОтветственныйОценки;
		Запись.Комментарий = ОценкаКачества.Комментарий;		
	КонецЦикла;
	НаборЗаписей.Записать();	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОценкуДляВсех(Оценка)
	Для Каждого СтрокаОценкиКачества Из ЭтаФорма[ИмяТаблицыОценка] Цикл
		Для Каждого КлючИЗначение Из ЗначениеОценкиПоИмениПоля Цикл
			СтрокаОценкиКачества[КлючИЗначение.Ключ] = КлючИЗначение.Значение = Оценка;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ДобавитьОцениваемогоНаСервере(Оцениваемый)
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВидыОценокКачестваКода.Ссылка КАК КритерийОценки,
		|	&Оцениваемый КАК Оцениваемый,
		|	ИСТИНА КАК СинонимИмяКолонкиОценкиПоУмолчанию
		|ИЗ
		|	Справочник.ВидыОценокКачестваКода КАК ВидыОценокКачестваКода";
	ИмяКолонкиОценкиПоУмолчанию = ИменаКолонокЗначенияОценки.Получить(ОценкаПоУмолчанию);
	Запрос = Новый Запрос;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "СинонимИмяКолонкиОценкиПоУмолчанию", ИмяКолонкиОценкиПоУмолчанию);
	Запрос.УстановитьПараметр("Оцениваемый", Оцениваемый);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЭтаФорма[ИмяТаблицыОценка].Добавить(), Выборка);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
